 
//Сообщить(КодСимвола("*"));
//Перейти ~Конец;

ТекстHtml = "<p>";

// Есть символы которые должны вызывать 
СпецСимволы = "";
МассивТегов = Новый Массив();
МассивТегов.Добавить("</p>");

КолСимволов   		  = СтрДлина(ТекстИсходник);
КонтентТекущейСтроки  = "";
КолПробеловПодряд     = 0;

ПредыдущийСимвол 	  = "";
КолОдинаковыхСимволов = 0;

Для НомерСимвола = 1 По КолСимволов Цикл
	
	Символ = Сред(ТекстИсходник, НомерСимвола, 1);
	
	Если Символ = Символ(10) Тогда 

		Если КонтентТекущейСтроки = "" Тогда
			
			// Закрываем параграф
			ТекстHtml = ТекстHtml + МассивТегов[0];
			МассивТегов.Удалить(0);
			
			Сообщить("Есть такая строка");	
			
			// Открываем новый параграф
			ТекстHtml = ТекстHtml + "<p>";
			МассивТегов.Добавить("</p>");
			
		ИначеЕсли КолПробеловПодряд = 2 Тогда	
			
			ТекстHtml = ТекстHtml + "</br>";
			КолПробеловПодряд = 0;
			
		КонецЕсли;
		
		// Обнуляем строку
		КонтентТекущейСтроки = "";
		
	ИначеЕсли КодСимвола(Символ) = 42 Тогда	
		
		// Если тег <em> был открыт закрываем его
		Если МассивТегов[0] = "<em>" Тогда
			
			ТекстHtml = ТекстHtml + "</em>";	
			МассивТегов.Удалить(0);
			
		Иначе
			
			ТекстHtml = ТекстHtml + "<em>";
			МассивТегов.Вставить(0, "<em>");
			
		КонецЕсли;
		
	Иначе
		
		Если КодСимвола(Символ) = 32 Тогда
			КолПробеловПодряд = КолПробеловПодряд + 1;
		Иначе
			КолПробеловПодряд = 0;
		КонецЕсли;
		
		ТекстHtml = ТекстHtml + Символ;
		КонтентТекущейСтроки = КонтентТекущейСтроки + Символ;
		
	КонецЕсли;
	
	ПредыдущийСимвол = Символ;
	
КонецЦикла;

ТекстHtml = ТекстHtml + МассивТегов[0];
МассивТегов.Удалить(0);

