
Функция НачалоБлокаВыделения(Текст, ПодстрокаПоиска, ТегНачала, ТегОкончания)
	
	ДлинаТекста    = СтрДлина(Текст);
	ДлинаПодстроки = СтрДлина(ПодстрокаПоиска);
	
	НачалоБлока = Найти(Текст, ПодстрокаПоиска);
	
	Если Не НачалоБлока = 0 И ДлинаТекста > НачалоБлока + ДлинаПодстроки Тогда
		Если Не ПодстрокаПоиска + " " = Сред(Текст, НачалоБлока, ДлинаПодстроки + 1) Тогда
			
			// Нашли начало блока выделения 
			// Надо найти конец блока выделения
			
			ПродолжениеТекста = Прав(Текст, ДлинаТекста - НачалоБлока - ДлинаПодстроки + 1);

			КонецБлока = Найти(ПродолжениеТекста, ПодстрокаПоиска);
			Если Не КонецБлока = 0 
				И Не Сред(ПродолжениеТекста, КонецБлока - 1, ДлинаПодстроки + 1) = " " + ПодстрокаПоиска  Тогда
				
				Текст = Лев(Текст, НачалоБлока - 1) + ТегНачала 
					+ Лев(ПродолжениеТекста, КонецБлока - 1)
					+ ТегОкончания + Прав(ПродолжениеТекста, СтрДлина(ПродолжениеТекста) - КонецБлока - ДлинаПодстроки + 1);

					Возврат Истина;

			КонецЕсли;

		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции // НачалоБлокаВыделения(ТекстСпецСимволы)

ТекстИсходник = 
"Параграф *Выделение текста* в строке
|Это *следующая строка** в параграфе
|
|Это новый параграф"; 

ТекстHtml = "<p>";

// Есть символы которые должны вызывать 
СпецСимволы = "";
МассивТегов = Новый Массив();
МассивТегов.Добавить("</p>");

КолСимволов = СтрДлина(ТекстИсходник);

Пока НачалоБлокаВыделения(ТекстИсходник, "*", "<strong>", "</strong>") Цикл

КонецЦикла;

Сообщить(ТекстИсходник);
