	
Процедура КонвертироватьТекстИзMarkdownВHtml(Текст)	
	
	ВыделитьБлокТекста(Текст, "**", "<strong>", "</strong>");
	ВыделитьБлокТекста(Текст, "*", "<em>", "</em>");
	
КонецПроцедуры // КонвертироватьТекстИзMarkdownВHtml()

Процедура ВыделитьБлокТекста(Текст, ПодстрокаПоиска, ТегНачала, ТегОкончания)	
	
	// Выделяемый блок должен быть обрамлен спец символами **Блок** или *Блок* 
	// без прабелов между символами и блоком

	ДлинаТекста    = СтрДлина(Текст);
	ДлинаПодстроки = СтрДлина(ПодстрокаПоиска);
	
	НачалоБлока = Найти(Текст, ПодстрокаПоиска);
	
	Если Не НачалоБлока = 0 И ДлинаТекста > НачалоБлока + ДлинаПодстроки Тогда
		Если Не ПодстрокаПоиска + " " = Сред(Текст, НачалоБлока, ДлинаПодстроки + 1) Тогда
			
			ПродолжениеТекста = Прав(Текст, ДлинаТекста - НачалоБлока - ДлинаПодстроки + 1);

			КонецБлока = Найти(ПродолжениеТекста, ПодстрокаПоиска);
			Если Не КонецБлока = 0 
				И Не Сред(ПродолжениеТекста, КонецБлока - 1, ДлинаПодстроки + 1) = " " + ПодстрокаПоиска  Тогда
				
				Текст = Лев(Текст, НачалоБлока - 1) + ТегНачала 
					+ Лев(ПродолжениеТекста, КонецБлока - 1)
					+ ТегОкончания + Прав(ПродолжениеТекста, СтрДлина(ПродолжениеТекста) - КонецБлока - ДлинаПодстроки + 1);

					ВыделитьБлокТекста(Текст, ПодстрокаПоиска, ТегНачала, ТегОкончания);

			КонецЕсли;

		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ВыделитьБлокТекста()

Процедура ПостроитьСписок(Текст)
	
	НачалоПункта = Найти(Текст, "- ");
	КонецПункта  = Найти(Текст, Символ(32));

	Текст = СтрЗаменить(Лев(Текст, КонецПункта), "_ ", " " + Прав(Текст, СтрДлина(Текст) - КонецПункта);


КонецПроцедуры

Процедура ВыделитьЦитатуВТексте(Текст)


	
КонецПроцедуры

Функция КонецТекущегоБлокаТекста(Текст, НачалоБлока)
	
	КонтекстБлока = Прав(Текст, СтрДлина(Текст) - НачалоБлока + 1);
	ДлинаКонтекста = СтрДлина(КонтекстБлока);

	КонецТекущейСтроки = Найти(Текст, Символ(32));
	Если КонецТекущейСтроки = 0 Или КонецТекущейСтроки = ДлинаКонтекста Тогда
		// Блок заканчивается в конце всего текста
		Возврат НачалоБлока + ДлинаКонтекста - 1;
	КонецЕсли;

	СледующаяСтрока	= 


КонецФункции // КонецТекущегоБлокаТекста(Текст, НачалоБлока)

ТекстИсходник = 
"Параграф *Выделение текста* в строке
|Это *следующая строка** в параграфе
|
|Это новый параграф"; 

ТекстHtml = "<p>";

// Есть символы которые должны вызывать 
СпецСимволы = "";
МассивТегов = Новый Массив();
МассивТегов.Добавить("</p>");

КолСимволов = СтрДлина(ТекстИсходник);

Пока НачалоБлокаВыделения(ТекстИсходник, "*", "<strong>", "</strong>") Цикл

КонецЦикла;

Сообщить(ТекстИсходник);
